[
  {
    "job_id": "4127617039",
    "title": "Data Governance Specialist - Remote",
    "company": "Between Technology",
    "location": "Barcelona, Catalonia, Spain",
    "description": "About the job\nEn BETWEEN apostamos por el mejor talento dentro del sector tecnológico. Nos involucramos en una gran variedad de proyectos punteros, trabajando con las últimas tecnologías. Actualmente en BETWEEN contamos con un equipo de más de 1000 personas.\n\nTrabajamos en ámbitos como BI, IoT, Big Data e I+D. En el área de Operaciones implantamos proyectos de Service Desk, Infraestructuras IT y proyectos Cloud, entre otros.\n\nBuscamos un/a Data Governance Specialist para liderar la implementación de estrategias de gobernanza de datos en un entorno internacional, impulsando la calidad, seguridad y cumplimiento normativo en la gestión de datos.\n\n¿Qué haré? Estas serán tus principales responsabilidades:\n\nDefinir y establecer políticas de gobernanza de datos a nivel corporativo.\nDesarrollar y mantener el marco de gestión de la calidad de los datos, asegurando consistencia y precisión.\nColaborar con equipos de IT y negocio para implementar prácticas de data governance en toda la organización.\nGarantizar el cumplimiento de normativas de protección de datos (GDPR, CCPA, etc.).\nLiderar iniciativas para la clasificación y catalogación de datos, impulsando una gestión eficiente.\nCapacitar a equipos internos en políticas y procedimientos de gobernanza de datos.\nRealizar auditorías periódicas para identificar riesgos y asegurar la alineación con estándares de seguridad y calidad de datos.\nDía a día 100% en inglés.\n\n\n¿Cómo lo haré?\n\nTendrás horario flexible y contrato indefinido.\nTrabajarás en remoto desde cualquier punto de España. En caso de acordar alguna visita a oficina, será a Barcelona (Poblenou). \nTendrás un PC y los periféricos necesarios para el desarrollo de tu trabajo.\nPodrás trabajar desde casa de cliente, nuestras oficinas de Barcelona en el 22@, los Hubs Tecnológicos o en el resto de las oficinas.\nTrabajarás en un entorno internacional.\n\n\nSi eres BETWEENER obtendrás estos beneficios:\n\nSeguro médico con Sanitas.\nDispondrás de oportunidades de formación y desarrollo profesional: Idiomas, cursos en Udemy, Certificaciones, Programa The Power Business School y Bootcamps especializados (Agile, DevOps, IA & Big Data, Ciberseguridad, etc.).\nContarás con un equipo de Talento que te acompañará durante toda tu experiencia con nosotros. ¡Haremos un café una vez al mes! Así, mantendremos el contacto.\nPondremos a tu disposición un amplio abanico de retos y proyectos acordes con tus objetivos personales y profesionales.\nPosibilidad de elegir cómo obtener parte de tu salario gracias a las ventajas fiscales de nuestra Retribución Flexible (Ticket restaurant, Ticket transporte, Ticket guardería).\nDescuentos para acceder a centros de Fitness con Gympass.\nAcceso a nuestro Club de Descuentos: Inspiring Benefits.\nEn BETWEEN nos gusta mucho hacer networking, por lo que te invitaremos a participar en todos estos eventos ¡y más!: las BETWEEN Nights, torneos deportivos, Black Mamba Race, viernes de vermut, juegos de mesa, etc.\nPrograma remunerado de recomendación de Talento.\nEn BETWEEN, la igualdad de oportunidades es uno de nuestros valores. Nuestro compromiso es contratar al mejor talento independientemente de su religión, sexo, edad y personas con otras capacidades y promover su desarrollo profesional y personal.\n\n\nRequisitos:\n\nMínimos:\n\nFormación: Grado en Ingeniería Informática, Sistemas de Información o campo relacionado.\nExperiencia mínima: 3-5 años en gobernanza de datos o gestión de calidad de datos.\nConocimientos técnicos: Experiencia en herramientas de gestión de datos (Collibra, Informatica, Talend), y en la implementación de marcos normativos (GDPR, CCPA).\nHabilidades: Excelentes capacidades de comunicación y liderazgo, capacidad de trabajo en entornos dinámicos e internacionales.\nIdiomas: Inglés avanzado. Francés valorable.\n\n\nValorables:\n\nCertificación en Data Governance o Data Management (CDMP, DGSP).\nExperiencia en el sector energético o en proyectos de transformación digital.\nIdiomas: Francés valorable.",
    "easy_apply": false,
    "apply_link": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4127617039",
    "source_url": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4127617039",
    "timestamp": "2025-02-01T23:32:08.845368",
    "analysis": {
      "scores": {
        "skills_match": 6.0,
        "role_alignment": 5.0,
        "remote_work": 10.0,
        "innovation": 9.0,
        "compensation": 7.0,
        "final_score": 7.2
      },
      "should_apply": true,
      "recommendation": "",
      "benefits": [],
      "total_score": 7.2
    }
  },
  {
    "job_id": "4124934372",
    "title": "Customer Insights & CRM Analyst",
    "company": "astara",
    "location": "Madrid, Community of Madrid, Spain",
    "description": "About the job\nAstara: Global Mobility for a World on the Move 🚀\n\nAt Astara, we’ve been redefining mobility for over 40 years, connecting people with cutting-edge technology and staying one step ahead. Today, with operations in 19 countries, annual revenues exceeding 5 billion euros, and a diverse team of 3,000+ people from 50 nationalities, we lead the way in automotive distribution and innovative mobility services. We are committed to sustainability, offering environmentally friendly solutions for a cleaner and more responsible future.\n\nOur portfolio goes far beyond vehicles: we offer flexible mobility solutions including ownership, subscription, and B2B/B2C services, all powered by our own digital platform. With a culture that values diversity and talent, Astara offers a collaborative, inclusive environment where you can grow and make an impact.\n\nAre you ready to join a company driving the future of mobility? At Astara, your ideas and talent move us forward!\n\nThe Role\n\nWe are looking for a dynamic and detail-oriented Customer Insights & CRM Analyst to join our global team. In this role, you will leverage data analytics and CRM processes to uncover actionable insights, improve customer engagement strategies, and drive business growth across multiple markets. You’ll collaborate with international teams, ensuring consistency and excellence in reporting, and play a vital role in the evolution of our CRM platform.\n\nMain Functions/Responsibilities\n\nAnalyze CRM process and data to identify trends, customer behaviors and opportunities for growth that can be translated into actionable business strategies.\nEnsure CRM data quality and accuracy through regular validation and cleaning processes.\nParticipate in the design and implement new KPIs and Power BI dashboards to meet evolving reporting requirements. \nIdentify and design new features for the evolution of the CRM platform.\nOptimize sales and aftersales processes by identifying business opportunities through data insights\n\nProfessional Experience/Qualifications\n\nFluent in English (C1+) and capable of working in a global environment. \n2-3 years in a similar role focusing on customer insights, CRM analytics, or data insights. \nStrong analytical skills.\nExperience working with international teams and managing multiple projects simultaneously.\nAbility to clearly communicate processes, strategies, and general requirements to both internal and external stakeholders.\nEagerness to learn and adapt to evolving technologies and methodologies\n\nIf you're driven by the power of data to craft meaningful experiences and make a tangible impact on customer relationships, we want you to be part of our forward-thinking team. Together, we'll shape the next generation of CRM and customer engagement.\n\n#DataImpact #CustomerExperienceRevolution #InnovateWithData #CustomerEngagementExcellence #TransformativeInsights #FutureOfCustomerRelations #DataDrivenSuccess\n\nAre you ready to embrace the challenge?",
    "easy_apply": false,
    "apply_link": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4124934372",
    "source_url": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4124934372",
    "timestamp": "2025-02-01T23:34:13.878290",
    "analysis": {
      "scores": {
        "skills_match": 8.0,
        "role_alignment": 7.0,
        "remote_work": 3.0,
        "innovation": 9.0,
        "compensation": 6.0,
        "final_score": 6.6
      },
      "should_apply": true,
      "recommendation": "",
      "benefits": [],
      "total_score": 6.6
    }
  },
  {
    "job_id": "4139670736",
    "title": "Data Engineer Python/Databriks. Ingles",
    "company": "Unknown Company",
    "location": "Unknown Location",
    "description": "About the job",
    "easy_apply": false,
    "apply_link": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4139670736",
    "source_url": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4139670736",
    "timestamp": "2025-02-01T23:34:25.398674",
    "analysis": {
      "scores": {
        "skills_match": 9.0,
        "role_alignment": 8.0,
        "remote_work": 5.0,
        "innovation": 6.0,
        "compensation": 5.0,
        "final_score": 8.0
      },
      "should_apply": true,
      "recommendation": "",
      "benefits": [],
      "total_score": 8.0
    }
  },
  {
    "job_id": "4127170549",
    "title": "Senior Data Engineer",
    "company": "Intellectsoft",
    "location": "Spain",
    "description": "About the job\nIntellectsoft is a software development company delivering innovative solutions since 2007. We operate across North America, Latin America, the Nordic region, the UK, and Europe.We specialize in industries like Fintech, Healthcare, EdTech, Construction, Hospitality, and more, partnering with startups, mid-sized businesses, and Fortune 500 companies to drive growth and scalability. Our clients include Jaguar Motors, Universal Pictures, Harley-Davidson, Qualcomm, and London Stock Exchange.Together, our team delivers solutions that make a difference. Learn more at www.intellectsoft.net\n\nThe product is an AI-powered platform that helps businesses make better decisions and work more efficiently. It uses advanced analytics and machine learning to analyze large amounts of data and provide useful insights and predictions. The platform is widely used in various industries, including healthcare, to optimize processes, improve customer experiences, and support innovation. It integrates easily with existing systems, making it easier for teams to make quick, data-driven decisions.\n\nRequirements\n\n4+ years of professional experience, including 2+ years of data engineering with Apache Spark and SQL\nProficiency in Python for data processing and automation\nKnowledge of PySpark, distributed computing, analytical databases and other big data technologies\nExpertise in designing and managing ETL pipelines and distributed data processing frameworks\nStrong knowledge of database systems, data modeling, and analytical databases\nHands-on experience with workflow orchestration tools such as Apache Airflow\nFamiliarity with cloud platforms like AWS, GCP, or Azure\nSolid understanding of software development lifecycles, including coding standards, version control, and testing\n\nNice to have skills\n\nBachelor's or master's degree in Computer Science or a related field\nFamiliarity with the data science and machine learning development process\nUnderstanding of Machine Learning pipelines or frameworks\n\nResponsibilities\n\nDesign and build highly reliable and scalable data pipelines using PySpark and big data technologies\nCollaborate with the data science team to develop new features that enhance model accuracy and performance\nCreate standardized data models to improve consistency across various deployments\nTroubleshoot and resolve issues in existing ETL pipelines and optimize workflows\nConduct POCs to evaluate new technologies and integrate additional data sources\nFollow and promote best practices for software development, ensuring high-quality solutions that meet requirements and deadlines\nDocument development updates and maintain clear technical documentation\n\n\nBenefits\n\n35 paid absence days per year for work-life balance of each specialist + 1 additional day for each following year of cooperation with the company\nUp to 15 unused absence days can be add to income after 12 month of cooperation\nHealth insurance for you\nDepreciation coverage for personal laptop usage for project needs\nUdemy courses of your choice\nRegular soft-skills trainings\nExcellence Сenters meetups",
    "easy_apply": false,
    "apply_link": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4127170549",
    "source_url": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4127170549",
    "timestamp": "2025-02-01T23:37:43.669573",
    "analysis": {
      "scores": {
        "skills_match": 7.0,
        "role_alignment": 6.0,
        "remote_work": 5.0,
        "innovation": 9.0,
        "compensation": 5.0,
        "final_score": 6.0
      },
      "should_apply": true,
      "recommendation": "",
      "benefits": [],
      "total_score": 6.0
    }
  },
  {
    "job_id": "4135505726",
    "title": "Data Scientist",
    "company": "Pearson",
    "location": "Sydney, New South Wales, Australia",
    "description": "About the job\nThe Team\n\nThe Workforce Solutions Data Science team spearheads the creation of innovative products by developing core intellectual property through a scientific, research-driven approach. We seek talented individuals eager to enhance our capabilities and drive significant customer value through the expansion of our data science IP.\n\nThe role sits within a cross-functional squad including Data Scientists, AI Engineers, and Ontologists. Each squad is responsible for the complete lifecycle of data science models—from concept and development through to deployment via APIs. This team specialises in building and maintaining models related to Pearson’s core occupation and skill ontologies, including data extraction and normalisation, analytics and recommendation systems. Positioned within Engineering, the squad collaborates closely with the Product team to ensure that the solutions align with strategic objectives and product priorities.\n\nThe Role\n\nReporting to the Lead Data Scientist, you will support the development and delivery of data science models. You will play a key role in maintaining high standards of data quality and model validation. Additionally, you will contribute to extending and refining existing data pipelines and models.\n\nKey Responsibilities\n\nData Manipulation: Utilise SQL to interact with Athena databases, querying and manipulating large datasets.\nAdvanced Analytical Implementation: Implement analytical techniques and experimental methods to discover data patterns and develop classification, prediction, and optimisation models, driving business outcomes.\nModel Development Support: Participate in the model development lifecycle from conception through deployment via APIs, focusing on creating scalable, efficient, and purpose-fit models.\nData Pipeline Maintenance: Collaborate with team members to maintain, track, and evaluate data pipelines and deployed models, with a strong emphasis on quality assurance processes to ensure accurate and reliable outputs that drive continuous improvement.\nGenerative AI Application: Leverage knowledge of Language Model Models (LLMs) to apply generative AI, developing innovative solutions that enhance data quality and creativity.\nAPI Development & Maintenance: Design, develop, and maintain robust REST APIs for model deployment, ensuring efficient and reliable integration with internal and external systems.\nQualitative Research and Analysis: Perform research, data analysis, and visualisation in the areas of future of work, workforce analytics, skills, and education, contributing to targeted outcomes.\nCollaboration with Product and Customer Teams: Engage with product and customer teams to understand client issues and ensure solutions deliver substantial value.\n\nExperience Overview\n\nData Science Experience: 1+ years in data science, with a robust background in machine learning or data analytics. Demonstrated proficiency in data-driven analysis and model development. Holds a formal qualification in Data Science, Computer Science, Software Engineering, Statistics, or a related field.\nMachine Learning and Statistical Models: Strong foundational skills in applied machine learning and statistical models, including NLP, linear/logistic regression, time series analysis, and recommender systems.\nPython Proficiency: Solid experience in Python for developing data processing tasks, conducting analyses, and deploying machine learning models. Familiarity with building and maintaining REST APIs is a plus.\nSQL and Database Management: Competent in performing SQL queries for effective data extraction, manipulation, and analysis, combined with a sound understanding of database design principles. Familiar with Athena and RDBMS such as PostgreSQL.\nAWS and Cloud Technologies: Proven abilities in using AWS to build and optimize data pipelines, with practical experience in deploying data models and managing large datasets in a cloud environment.\nGenerative AI: Foundational understanding of generative AI concepts, with the ability to apply these technologies to improve data quality, model development and validation.\nProfessional fluency in English is essential\n\n At Pearson we ‘add life to a lifetime of learning’ so everyone can realise the life they imagine. We do this by creating vibrant and enriching learning experiences designed for real-life impact. \n\nPearson is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nWho We Are\n\nAt Pearson, our purpose is simple: to help people realize the life they imagine through learning. We believe that every learning opportunity is a chance for a personal breakthrough. We are the world's lifelong learning company. For us, learning isn't just what we do. It's who we are. To learn more: We are Pearson.\n\nPearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We want a team that represents a variety of backgrounds, perspectives and skills. The more inclusive we are, the better our work will be. All employment decisions are based on qualifications, merit and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status or any other group protected by law. We strive for a workforce that reflects the diversity of our communities.\n\nIf you are an individual with a disability and are unable or limited in your ability to use or access our career site as a result of your disability, you may request reasonable accommodations by emailing TalentExperienceGlobalTeam@grp.pearson.com.\n\nNote that the information you provide will stay confidential and will be stored securely. It will not be seen by those involved in making decisions as part of the recruitment process.\n\nJob: RESEARCH AND DEVELOPMENT\n\nOrganization: Workforce Skills\n\nSchedule: FULLTIME\n\nWorkplace Type: Hybrid\n\nReq ID: 18142",
    "easy_apply": false,
    "apply_link": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4135505726",
    "source_url": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4135505726",
    "timestamp": "2025-02-01T23:37:55.371987",
    "analysis": {
      "scores": {
        "skills_match": 9.0,
        "role_alignment": 8.0,
        "remote_work": 2.0,
        "innovation": 8.0,
        "compensation": 7.0,
        "final_score": 8.0
      },
      "should_apply": true,
      "recommendation": "",
      "benefits": [],
      "total_score": 8.0
    }
  },
  {
    "job_id": "4132053471",
    "title": "Data Scientist IA Generativa",
    "company": "Sopra Steria",
    "location": "Madrid, Community of Madrid, Spain",
    "description": "About the job\nDescripción de la empresa\n\nPorque trabajar en Sopra Steria, también es sentir Sopra Steria.\n\nSomos un reconocido líder europeo en consultoría, servicios digitales y desarrollo de software, con cerca de 56.000 empleados en casi 30 países y más de 4.000 en España.\n\nNos enfocamos en las personas, en su formación y desarrollo profesional, lo que nos impulsa a crecer y mejorar constantemente.\n\nTenemos pasión por lo digital y al igual que tú, buscamos la mejor de las aventuras. Queremos que tu día a día se convierta en la mejor de tus inspiraciones. Que aprendas, aportes, te diviertas, crezcas y que, sobre todo, disfrutes al máximo.\n\nSi quieres formar parte de un equipo “Great Place to Work”, ¡Sigue leyendo!\n\nDescripción del empleo\n\n¿Qué reto proponemos?\n\nDentro del Área Data, Analytics & AI liderado por Responsable de IA de un importante cliente del sector Retail, participar en la vida diaria de los proyectos en curso, aportando la experiencia ya acumulada y con un camino de aprendizaje en uno de los departamentos con mayor proyección del cliente.\n\nEs un equipo joven y en continua expansión, el proyecto cuenta con una modalidad híbrida en las oficinas de Tomás Bretón, Madrid.\n\nRequisitos\n\n¿Qué buscamos?\n\n Construir modelos de analítica avanzada e IA multimodal, incluyendo la capacidad de entrenar modelos LLM, GAN y GLO, entre otros; con datos propios de la organización.\n Entrenar, evaluar y optimizar modelos LLM o IA generativa utilizando prompts y técnicas avanzadas de procesamiento de lenguaje natural.\n Implementar modelos en un entorno de producción, asegurándose de que funcionen correctamente y cumpliendo con los requisitos de la empresa.\n Investigar y desarrollar nuevas técnicas en el ámbito de la IA generativa, manteniéndose al día con las últimas tendencias en el campo y aplicando las mejores prácticas para resolver problemas empresariales de manera eficiente.\n Identificar problemas empresariales y proponer soluciones innovadoras utilizando técnicas de inteligencia artificial, trabajando en colaboración con otros miembros del equipo para garantizar el éxito de los proyectos.\nTrabajar con equipos de ingeniería y científicos de datos para integrar y procesar conjuntos de datos multimodales, asegurando la calidad y la coherencia de los datos utilizados para el entrenamiento de los modelos.\n Comunicar los resultados y las conclusiones de los modelos de IA generativa multimodal a audiencias no técnicas, utilizando visualizaciones y explicaciones claras y concisas para que puedan comprender la información.\n\nInformación adicional\n\n¿Qué tenemos para ti?\n\nContrato indefinido y jornada completa\n23 días de vacaciones\nFormación continua: competencias técnicas, transversales y de idiomas. Contamos con acceso a certificaciones, formaciones de los principales Partners Tecnológicos, plataformas online y ¡mucho más!\nSeguro de vida y de accidentes\nPosibilidad de acogerte a nuestra retribución flexible (seguro médico, cheques guarderías, transporte, comida y formación)\nAcceso a Privilege Club, donde encontrarás descuentos interesantes en las principales marcas\nOnboarding personalizado y detallado. Te acompañamos en todo momento para que te sientas #soprano desde el primer momento.\nOficina con espacios reservados al ocio. ¡Trabajo y diversión unido!\nCompañerismo y buen ambiente, el poder de la unión lo tenemos presente.\n\nY lo más importante…Tienes la posibilidad de desarrollar tu carrera profesional con nosotros: Crearemos juntos un plan de carrera personalizado. Te formarás, marcaremos objetivos y llevaremos a cabo un seguimiento para asegurarnos de que lo conseguimos juntos. Escuchamos tus prioridades y luchamos por ellas.\n\n¡Aquí tu voz importa! ¡Únete a nosotros y sé parte de algo más!\n\nThe World Is How We Shape It\n\nAdquirimos el compromiso de respetar la diversidad, creando un ambiente de trabajo inclusivo y aplicando políticas que favorezcan la inclusión y promuevan el respeto social y cultural en cuestiones de género, edad, funcional, orientación sexual y religión con igualdad de oportunidades.",
    "easy_apply": false,
    "apply_link": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4132053471",
    "source_url": "https://www.linkedin.com/jobs/collections/top-applicant/?currentJobId=4132053471",
    "timestamp": "2025-02-01T23:38:17.828723",
    "analysis": {
      "scores": {
        "skills_match": 9.0,
        "role_alignment": 8.0,
        "remote_work": 2.0,
        "innovation": 9.0,
        "compensation": 7.0,
        "final_score": 7.0
      },
      "should_apply": true,
      "recommendation": "",
      "benefits": [],
      "total_score": 7.0
    }
  }
]